#ifndef QUESTIONLIST_H
#define QUESTIONLIST_H

#include "questiontemplate.h"

namespace QuestionList{
    /*  問題庫宣告格式：
     *  QTMC* Q<問題序號> = new QTMC(<問題>, {<選項>, ...}, <正確選項>);
     *  <正確選項>: A -> Option::A; B -> Option::B; C -> Option::C; D -> Option::D
     */
    using QTMC = QuestionTemplate::MultipleChoice;

    //  難度：中等偏難
    QTMC* Q001 = new QTMC("下列哪個成語和\"道聼塗説\"\n詞意更接近？",{"空穴來風", "三人成虎"},Option::A);

    //  難度：中等
    QTMC* Q002 = new QTMC("\"但願人長久，千里共嬋娟\"，\n其中嬋娟指的是什麼？",{"月亮","姻緣"},Option::A);

    //  難度：難
    QTMC* Q003 = new QTMC("\"爆竹聲中一歲除，春風送暖入屠蘇\"，\n這裡的\"屠蘇\"指的是：",{"蘇州","房屋","酒","莊稼"},Option::C);

    //  難度：難
    QTMC* Q004 = new QTMC("\"拱手而立\"表示對長者的尊敬，\n一般來說，男子行拱手禮時應該：",{"左手在外","右手在外"},Option::A);

    //  難度：中等偏難
    QTMC* Q005 = new QTMC("我國的京劇臉譜色彩含義豐富，紅色一般表示\n忠勇俠義，白色一般表示陰險奸詐，\n那麼黑色一般表示：",{"忠耿正直","剛愎自用"},Option::A);

    //  難度：難
    QTMC* Q006 = new QTMC("《三十六計》是體現我國古代卓越軍事思想\n的一部兵書，下列不屬於《三十六計》的是：",{"渾水摸魚","反戈一擊","笑裡藏刀","反客為主"},Option::B);

    //  難度：中等偏難
    QTMC* Q007 = new QTMC("\"床前明月光\"是李白的千古名句，\n其中\"床\"指的是什麼？",{"窗戶","臥具","井上的圍欄"},Option::C);

    //  難度：中等偏簡單
    QTMC* Q008 = new QTMC("1932 年，清華大學招生試題中有一道對對子題\n，上聯\"孫行者\"，下面下聯中最合適的是：",{"祖沖之","周作人","郁達夫","唐三藏"},Option::A);

    //  難度：難
    QTMC* Q009 = new QTMC("\"月上柳梢頭，人約黃昏後\"描寫的是哪個傳統節日？",{"中秋節","元宵節","端午節","七夕節"},Option::B);

    //  難度：中等
    QTMC* Q010 = new QTMC("我國古代有很多計量單位，比如詩句\n\"黃河遠上白雲間，一片孤城萬仞山\"中\n的\"仞\"，一仞約相當於：",{"一個成年人的高度","成年人一臂的長度"},Option::B);

    //  難度：難偏地獄
    QTMC* Q011 = new QTMC("下列哪一句詩描寫的場景\n最適合採用水墨畫來表現？",{"落霞與孤鶩齊飛，\n秋水共長天一色。","返景入深林，\n複照青苔上。","孤舟蓑笠翁，\n獨釣寒江雪。","接天蓮葉無窮碧，\n映日荷花別樣紅。"},Option::C);

    //  難度：簡單
    QTMC* Q012 = new QTMC("下列哪個成語典故與項羽有關？",{"隔岸觀火","暗度陳倉","背水一戰","破釜沉舟"},Option::D);

    //  難度：難
    QTMC* Q013 = new QTMC("《百家姓》中沒有下面哪個姓？",{"烏","巫","肖","蕭"},Option::C);

    //  難度：中等偏難
    QTMC* Q014 = new QTMC("\"生旦淨末丑\"是京劇的行當，其中\"淨\"是：",{"男角","女角"},Option::A);

    //  難度：難
    QTMC* Q015 = new QTMC("我們常說的\"十八般武藝\"最初指的是什麼？",{"使用十八種兵器的技能","十八種武術動作"},Option::A);

    //  難度：簡單
    QTMC* Q016 = new QTMC("假如你的一首五絕詩被雜誌社採用，\n按照正文部分每字5元來計算，\n你應得多少稿費？",{"50元","100元","200元"},Option::B);

    //  難度：難偏地獄
    QTMC* Q017 = new QTMC("下面哪個字常用作表示\n順序的第五位元？",{"戊","戍","戌"},Option::A);

    //  難度：中等偏簡單
    QTMC* Q018 = new QTMC("諸子百家中名家的特點是注重邏輯辯證，\n以下哪個典故能體現名家的這一特點？",{"白馬非馬","指鹿為馬"},Option::A);

    //  難度：中等偏難
    QTMC* Q019 = new QTMC("古人的婚禮在什麼時間舉行？",{"早上","中午","傍晚"},Option::C);

    //  難度：中等偏難
    QTMC* Q020 = new QTMC("\"近朱者赤，近墨者黑\"所蘊含的道理\n和下列哪句話最相似？",{"青出於藍，而勝於藍","蓬生麻中，不扶而直","公生明，偏生暗"},Option::B);

    //  難度：難
    QTMC* Q021 = new QTMC("\"天時不如地利，地利不如人和\"出自：",{"《孟子》","《莊子》"},Option::A);

    //  難度：中等
    QTMC* Q022 = new QTMC("我國書法藝術博大精深，請問\n\"歐體\"是指誰的字體？",{"歐陽修","歐陽詢"},Option::B);

    //  難度：中等偏簡單
    QTMC* Q023 = new QTMC("文學史上被稱作\"小李杜\"的是杜牧和誰？",{"李賀","李商隱"},Option::B);

    //  難度：簡單
    QTMC* Q024 = new QTMC("\"大禹治水\"的故事家喻戶曉，\n大禹治理的是哪個流域的洪水？",{"長江流域","黃河流域"},Option::B);

    //  難度：難偏地獄
    QTMC* Q025 = new QTMC("古代宮殿大門前成對的石獅一般都是：",{"左雄右雌","左雌右雄"},Option::A);

    //  難度：中等  （總所周知最離譜的答案往往是正確答案）
    QTMC* Q026 = new QTMC("\"結髮\"在古時是指結婚時：",{"丈夫把頭髮束起來","妻子把頭髮束起來","把夫妻頭髮束在一起"},Option::C);

    //  難度：地獄
    QTMC* Q027 = new QTMC("\"鄂爾多斯\"在蒙古語中是什麼意思？",{"大草原","盛產羊毛的地方","眾多宮殿","美麗的地方"},Option::C);

    //  難度：簡單
    QTMC* Q028 = new QTMC("《西遊記》中唐僧的原型是：",{"玄奘","鑒真"},Option::A);

    //  難度：難
    QTMC* Q029 = new QTMC("唐代詩人賈島\"二句三年得，一吟雙淚流\"的詩句是：",{"獨行潭底影，數息樹邊身。","鳥宿池邊樹，僧敲月下門。"},Option::A);

    //  難度：中等偏難
    QTMC* Q030 = new QTMC("我國傳統表示次序的\"天干\"共有幾個字？",{"十個","十二個"},Option::A);

    //  難度：難
    QTMC* Q031 = new QTMC("被譽為\"萬園之園\"的是：",{"頤和園","圓明園"},Option::B);

    //  難度：簡單
    QTMC* Q032 = new QTMC("\"水\"字屬於下列哪種漢字構成方式？",{"象形字","表意字"},Option::A);

    //  難度：難
    QTMC* Q033 = new QTMC("現在我們常用\"陽春白雪\"\n和\"下里巴人\"指代高雅和通俗的文藝作品，\n請問這兩個成語最初指的是什麼？",{"文章","畫作","樂曲"},Option::C);

    //  難度：難偏地獄
    QTMC* Q034 = new QTMC("京劇《貴妃醉酒》是根據哪部\n古代戲曲改編而成的？",{"《桃花扇》","《長生殿》","《牡丹亭》","《南柯記》"},Option::B);

    //  難度：難
    QTMC* Q035 = new QTMC("道家思想在我國影響深遠，請問歷史中的\n哪一時期\n最接近道家所主張的無為而治？",{"文景之治","光武中興","貞觀之治","開無盛世"},Option::A);

    //  難度：中等
    QTMC* Q036 = new QTMC("下面哪句話出自《孟子》？",{"\"水能載舟，亦能覆舟\"","\"先天下之憂而憂，\n後天下之樂而樂\"","\"民惟邦本，本固邦寧\"","\"獨樂樂，與人樂樂，孰樂？\""},Option::D);

    //  難度：中等
    QTMC* Q037 = new QTMC("下列哪個不是北京的別稱？",{"大都","中都","上都","南京"},Option::C);

    //  難度：中等偏簡單（選個沒聽過的答案吧）
    QTMC* Q038 = new QTMC("\"諱疾忌醫\"典故中的君王是：",{"齊桓公","蔡桓公"},Option::B);

    //  難度：簡單
    QTMC* Q039 = new QTMC("\"桃花潭水深千尺，不及汪倫送我情\"\n詩中的\"我\"指的是誰？",{"杜甫","李白"},Option::B);

    //  難度：難偏地獄
    QTMC* Q040 = new QTMC("我們熟悉的《百家姓》是\n按照什麼方式排列的？",{"人口數量","政治地位"},Option::B);

    //  難度：中等偏難
    QTMC* Q041 = new QTMC("\"一門父子三詞客，千古文章八大家\"\n這幅\n對聯中提到的\"三父子\"是：",{"曹操、曹丕、曹植","蘇洵、蘇軾、蘇轍","班彪、班固、班超"},Option::B);

    //  難度：難偏地獄
    QTMC* Q042 = new QTMC("孔子提倡中庸之道的理論基礎是：",{"陰陽五行","天人合一","道法自然"},Option::B);

    //  難度：難
    QTMC* Q043 = new QTMC("拍電影時常用的\"殺青\"來表示拍攝完成，\n\"殺青\"原指什麼？",{"製作竹筒的一道工序","加工新茶的一種方法"},Option::A);

    //  難度：中等偏難
    QTMC* Q044 = new QTMC("下面哪個成語和曹操有關？",{"畫餅充饑","望梅止渴"},Option::B);

    //  難度：難
    QTMC* Q045 = new QTMC("成語\"白駒過隙\"比喻：",{"速度飛快","時光飛逝"},Option::B);

    //  難度：難偏地獄
    QTMC* Q046 = new QTMC("墨子的主要思想是\"兼愛\"，他所反對的\n\"愛有差等\"這一觀點是哪家學派的？",{"儒家","法家","道家","名家"},Option::A);

    //  難度：難偏地獄
    QTMC* Q047 = new QTMC("下列選項中與\"亡羊補牢\"意思最接近的是：",{"人無遠慮，必有近憂","禍兮，福之所倚，福兮，祝之所伏","往者不可諫，來者猶可追","失之東隅，收之桑榆"},Option::C);

    //  難度：難
    QTMC* Q048 = new QTMC("王羲之對一種動物十分偏愛，並從它的體態姿勢上\n領悟到書法執筆運筆的道理，這是什麼動物？",{"鶴","鵝","雞","鴨"},Option::B);

    //  難度：難，陷阱題
    QTMC* Q049 = new QTMC("\"美\"字最初的含義是：",{"羊大即為美","戴著頭飾站立的人","土地裡生長的花朵","遠方茂盛的森林"},Option::B);

    //  難度：簡單 （排除法）
    QTMC* Q050 = new QTMC("孔子為自己的教學定為\"孔門四教\"，具體指的是：",{"修身、齊家、治國、平天下","文、行、忠、信"},Option::B);

    //  難度：難
    QTMC* Q051 = new QTMC("以下兩位誰曾經中過狀元？",{"范仲淹","文天祥"},Option::B);

    //  難度：難
    QTMC* Q052 = new QTMC("俗語說\"化干戈為玉帛\"，干戈都是兵器，\n其中哪個指的是防禦武器？",{"干","戈"},Option::A);

    //  難度：難
    QTMC* Q053 = new QTMC("《霸王別姬》是京劇中的名段，\n\"虞姬\"這一角色在京劇中屬於：",{"花旦","青衣"},Option::B);

    //  難度：難偏地獄
    QTMC* Q054 = new QTMC("《尚書》中的\"尚\"是什麼意思？",{"上古","崇尚","官名"},Option::A);

    //  難度：中等偏難
    QTMC* Q055 = new QTMC("\"勿以惡小而為之，勿以善小而不為\"\n語出《三國志》，這是誰說的？",{"諸葛亮","曹操","劉備","周瑜"},Option::C);

    //  難度：難偏中等
    QTMC* Q056 = new QTMC("如果在華佗去世後，曹操還想尋找一位名醫\n為自己治病，他可以找下列的哪一位？",{"扁鵲","孫思邈","李時珍","張仲景"},Option::D);

    //  難度：中等（出名）
    QTMC* Q057 = new QTMC("在中國風俗中，常常避諱73和84這兩個歲數，\n因為這是兩位歷史人物去世的年齡，他們是：",{"孔子和孟子","老子和莊子","漢高祖和漢武帝","周武王和周文王"},Option::A);

    //  難度：中等偏簡單
    QTMC* Q058 = new QTMC("\"一問三不知\"出自《左傳》，說的是\n哪\"三不知\"？",{"天文、地理、文學","事情的開始、經過、結果","孔子、孟子、老子","自己的姓名、籍貫、生辰八字"},Option::B);

    //  難度：難偏中等
    //  經過修改
    QTMC* Q059 = new QTMC("\"不以物喜，不以己悲\"出自哪篇目哪篇古文？",{"《醉翁亭記》","《岳陽樓記》","《滕王閣序》"},Option::B);

    //  難度：難
    QTMC* Q060 = new QTMC("\"水則載舟，水則覆舟\"是誰的名言？",{"老子","荀子"},Option::B);

    //  難度：難
    QTMC* Q061 = new QTMC("篆刻分為陰文印和陽文印，\n北京奧運會徽\"中國印\"是：",{"陰文印","陽文印"},Option::A);

    //  難度：中等偏難
    QTMC* Q062 = new QTMC("向別人介紹自己的弟弟妹妹\n應該用下面哪種稱謂？",{"家弟家妹","舍弟舍妹"},Option::B);

    //  難度：難
    QTMC* Q063 = new QTMC("\"揭竿為旗，斬木為兵\"形容的是哪一場起義？",{"赤眉起義","陳勝吳廣起義","綠林起義","黃巾起義"},Option::B);

    //  難度：難
    QTMC* Q064 = new QTMC("以下哪位詩人是\"初唐四傑\"之一？",{"王維","王勃"},Option::B);

    //  難度：中等偏簡單
    QTMC* Q065 = new QTMC("古代戰爭中指揮軍隊撤退時要敲擊：",{"鼓","鉦"},Option::B);

    //  難度：中等
    QTMC* Q066 = new QTMC("\"詞苑千載，群芳競秀，盛開一枝女兒花\"\n說的是哪位歷史上的哪位才女？",{"朱淑真","秦良玉","李清照"},Option::C);

    //  難度：中等
    QTMC* Q067 = new QTMC("古人用\"父母教，須敬聽；父母責，須順承\"\n來勸諭人們要尊敬父母，這句話出自：",{"《弟子規》","《三字經》","《千字文》"},Option::A);

    //  難度：中等偏難
    QTMC* Q068 = new QTMC("下列哪項<font color=\"#ff0000\">不是</font>端午節的習俗？",{"掛香包","插艾蒿","登高采菊","喝雄黃酒"},Option::D);

    //  難度：地獄
    QTMC* Q069 = new QTMC("\"態生兩靨之愁，嬌襲一身之病\"是\n寶玉對黛玉的第一印象，其中\"靨\"是指：",{"酒窩","眼睛","嘴角","腮幫"},Option::A);

    //  難度：難偏地獄
    QTMC* Q070 = new QTMC("\"弱冠\"指的是男子多少歲？",{"十五歲","二十歲"},Option::B);

    //  難度：難
    QTMC* Q071 = new QTMC("\"入木三分\"這個成語原本是用來形容什麼的？",{"文章","書法"},Option::B);

    //  難度：難
    QTMC* Q072 = new QTMC("河姆渡遺址位於：",{"黃河流域","長江流域"},Option::B);

    //  難度：難
    //  經過修改
    QTMC* Q073 = new QTMC("《詩經》是我國第一部詩歌總集，\n《詩經》裡面包括多少首詩？",{"二百九十五首","三百首","三百零五首"},Option::C);

    //  難度：難，陷阱題
    //  經過修改
    QTMC* Q074 = new QTMC("《孫子兵法》的作者是：",{"孫武","孫臏","孫子"},Option::A);

    //  難度：中等
    QTMC* Q075 = new QTMC("算盤是中國傳統計算工具，\n利用算盤能進行開平方的運算嗎？",{"能","不能"},Option::A);

    //  難度：難
    QTMC* Q076 = new QTMC("下面哪個成語與秦始皇有關？",{"指鹿為馬","奇貨可居","圖窮匕見"},Option::C);

    //  難度：中等偏簡單
    QTMC* Q077 = new QTMC("唱念做打是中國戲曲表演的四種藝術手段，\n也是戲曲表演的四項基本功，其中\"做\"指的是：",{"面部表情","舞蹈動作","器械表演"},Option::B);

    //  難度：難
    QTMC* Q078 = new QTMC("\"海上生明月，天涯共此時\"是誰的名句？",{"王勃","張九齡"},Option::B);

    //  難度：中等
    //  經過修改
    QTMC* Q079 = new QTMC("李清照詞中的\"綠肥紅瘦\"描寫的\n是什麼季節的景色？",{"春","夏","秋","冬"},Option::A);

    //  難度：中等偏難
    QTMC* Q080 = new QTMC("成語\"機不可失\"出自張九齡之筆，\n它的下句是：",{"時不再來","失不再來"},Option::A);

    //  難度：難偏地獄
    QTMC* Q081 = new QTMC("\"烽火連三月，家書抵萬金\"\n古代書信通過郵驛傳遞。\n唐代管理這類工作的中央管理機構是：",{"尚書省","中書省","門下省"},Option::A);

    //  難度：中等
    QTMC* Q082 = new QTMC("陝西省一塊著名的\"無字碑\"，\n它與哪位皇帝有關？",{"秦始皇","武則天"},Option::B);

    //  難度：難偏地獄
    QTMC* Q083 = new QTMC("西湖的白堤的得名與哪位詩人有關？",{"白居易","李白"},Option::A);

    //  難度：中等
    QTMC* Q084 = new QTMC("孟子說：\"不以規矩，不成方圓\"，\n這裡\"規矩\"的意思是：",{"法律法度","美德善行","圓規曲尺","道德準則"},Option::A);

    //  難度：難
    QTMC* Q085 = new QTMC("\"一琴一鶴\"所形容的是：",{"為政清簡","平安長春","淡泊名利"},Option::A);

    //  難度：中等偏簡單
    QTMC* Q086 = new QTMC("\"夕陽無限好，只是近黃昏\"是誰的詩句？",{"李商隱","駱賓王"},Option::A);

    //  難度：中等
    QTMC* Q087 = new QTMC("《紅樓夢》是我國古代著名的\n長篇小說之一，它的別名是：",{"《金陵記》","《石頭記》"},Option::B);

    //  難度：中等偏難
    QTMC* Q088 = new QTMC("成語\"一衣帶水\"中的\"水\"原指：",{"黃河","長江","淮河"},Option::B);

    //  難度：難偏地獄
    QTMC* Q089 = new QTMC("\"問世間情為何物，直教生死相許\"這句詩是誰寫的？",{"元好問","柳永","晏殊"},Option::A);

    //  難度：難偏地獄
    QTMC* Q090 = new QTMC("孟子說：\"君子有三樂\"，\n下列哪項不在其\"三樂\"之列？",{"父母俱存，兄弟無故","仰不愧於天，俯不作於人","鄉人無不稱其善也","得天下英才而教育之"},Option::C);

    //  難度：難
    QTMC* Q091 = new QTMC("中國歷史上被譽為\"藥王\"的是：",{"扁鵲","華佗","孫思邈","李時珍"},Option::C);

    //  難度：中等偏難
    //  經過修改
    QTMC* Q092 = new QTMC("張衡發明的地動儀上有幾條龍？ ",{"八條","四條"},Option::A);

    //  難度：難
    QTMC* Q093 = new QTMC("都江堰和秦始皇陵哪個的修建年代更早？",{"都江堰","秦始皇陵"},Option::A);

    //  難度：難
    QTMC* Q094 = new QTMC("在古代人們尊稱對方的妻子",{"令愛","令正","令堂"},Option::A);

    //  難度：中等
    QTMC* Q095 = new QTMC("從事貿易活動的人叫做\"商人\"，\n這跟歷史上的商代有關嗎？",{"有關","無關"},Option::A);

    //  難度：難偏中等
    QTMC* Q096 = new QTMC("水滸一百單八將中有幾位女性？",{"兩位","三位"},Option::B);

    //  難度：難
    QTMC* Q097 = new QTMC("蘇軾在《念奴嬌·赤壁懷古》中提到了\n\"羽扇綸巾，談笑間，檣櫓灰飛煙滅\"，\n\"羽扇綸巾\"形容的是下面哪位歷史人物？",{"諸葛亮","周瑜","曹操"},Option::B);

    //  難度：中等，陷阱題
    QTMC* Q098 = new QTMC("按照戲曲界的行話，以下哪個表示最後一出？",{"壓軸戲","大軸戲"},Option::B);

    //  難度：難
    QTMC* Q099 = new QTMC("成語\"請君入甕\"，\"請\"的是誰？",{"來俊臣","周興"},Option::B);

    //  難度：難
    QTMC* Q100 = new QTMC("琵琶本名\"批把\"，\"批把\"一詞來源於什麼？",{"製造琵琶的材料","演奏琵琶的方式"},Option::A);
}

#endif // QUESTIONLIST_H
